%% デジタル波形生成: サイン波形の近似
% 
% デジタル-アナログコンバータ (DAC) に結合された組み込みプロセッサとデジタル
% 信号プロセッサ(DSP) を使用した、アナログ波形のリアルタイム 直接デジタル合成
% が一般的になりつつあります。組み込みシステムや計測器で使用する波形作成は、
% MATLAB と Siumulink を密接に統合することにより効率化することができます。 
% 実際に Real-Time Workshop でターゲットハードウェアに実装する前に、波形生成
% アルゴリズムと関連データをデスクトップで作成、解析することができます。
% このデモでは、組み込みシステムと、任意波形生成機器におけるデジタル波形合成
% アプリケーションで使用する、サイン波形データテーブルの設計と評価に必要な主要手順
% のいくつかを紹介します。 (モデル: <matlab:sldemo_tonegen>)
%
% 可能な場合、サイン波形をデジタル的に最も正確に合成する方法は、omega*t を間隔
% 0 ～2*pi に畳み込んで、フル精度の sin() 関数を直接各時間ステップに対して 
% 計算することです。リアルタイムシステムでは、この計算負荷が大きいため、
% このアプリーチは行なえません。この障壁を取り除くもっとも一般的な方法は、 
% 0から2*pi、または半波形または1/4波形で対象性を利用し、テーブルの値を使用して
% sin() 波形の振る舞いを近似することです。
%
% 考慮すべきトレードオフとしては、アルゴリズムの効率性、必要なデータ ROM サイズ、
% 実行の精度/スペクトル純度などがあります。独自の波形デザインを行なう場合にも、
% 同様の解析が必要です。テーブルデータとルックアップテーブルだけでは、フィード
% においてパフォーマンスは決まりません。その他に、リアルタイムクロックや、D/C 
% コンバーターの精度や安定性への考慮が、全体の性能評価には必要です。Signal 
% Processing Toolbox と Signal Processing Blockset は、この分野において、 
% MATLAB とSIMULINK の能力を補完します。
% 
% このデモで使用されている歪解析は、次の書籍内で紹介されている原理に基づいています。
% "Digital Sine-Wave Synthesis Using the DSP56001/DSP56002", by 
% Andreas Chrysafis, Motorola Inc. 1988

% Copyright 1990-2006 The MathWorks, Inc.
