% PLOT  時系列データのプロット
%
%   PLOT(TS) は、ゼロ次ホールド、または線形補間のいずれかを使って、時間に
%   対する時系列データをプロットします。 時系列データの補間が 'zoh' の
%   場合、階段状プロットを生成し、それ以外の場合は、標準のプロットを作成
%   します。
%
%   時系列イベントが存在する場合、赤色の円のマーカーを使用してプロットに
%   印をつけます。
%
%   PLOT は、数値配列に対して、MATLAB の PLOT ユーティリティによって使用
%   される修飾子を指定することができます。 これらの修飾子は、プロットの
%   外観を変更するための補助入力として指定することができます。
%
%   例:
%   plot(ts,'-r*') は、色を赤でマーカーを '*' として標準のラインプロットを
%   使ってプロットします。
%   plot(ts,'ko','MarkerSize',3) は、プロットを描画するためにサイズ 3 の
%   黒丸のマーカーを使用します。
%
%   参考 PLOT, TIMESERIES, TIMESERIES/ADDEVENT
%


%   Author(s): Rong Chen, James Owen
%   Copyright 2004-2005 The MathWorks, Inc.
